CSI API ETABS v1
cAreaObj.SetLoadWindPressure Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLoadWindPressure(
	string Name,
	string LoadPat,
	int MyType,
	double Cp,
	eItemType ItemType = eItemType.Objects
)
Function SetLoadWindPressure (
	Name As String,
	LoadPat As String,
	MyType As Integer,
	Cp As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim LoadPat As String
Dim MyType As Integer
Dim Cp As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetLoadWindPressure(Name,
	LoadPat, MyType, Cp, ItemType)
int SetLoadWindPressure(
	String^ Name,
	String^ LoadPat,
	int MyType,
	double Cp,
	eItemType ItemType = eItemType::Objects
)
abstract SetLoadWindPressure :
        Name : string *
        LoadPat : string *
        MyType : int *
        Cp : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
LoadPat
Type: System.String
MyType
Type: System.Int32
Cp
Type: System.Double
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace